Autodesk.Revit.DB.IFC.IFCFileReadOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.IFC.IFCFileReadOptions.XMLConfigFileName
The XML configuration file name. It is used only for reading IFC-XML format file.
Remarks:
It uses default configuration if it is not set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.IFC.IFCFileReadOptions.FileName
The full file name of the IFC file to be read.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.IFC.IFCFileReadOptions.#ctor
Creates a default IFCFileReadOptions.
Since:
2014

Autodesk.Revit.DB.IFC.IFCFileReadOptions
This class contains options to read an IFC file.
Since:
2014